src/main/resources/format.xml

<Transaction>
    <Message>
        <message_id>H2H_RECEIVE_MONEY_SEARCH_WGHHPH6471P_PROD_TEST_2026-04-22-093528070359</message_id>
        <Header>
            <LoggingMode>NORMAL</LoggingMode>
            <ApplicationName>H2H</ApplicationName>
            <ServiceName>RECEIVE_MONEY_SEARCH</ServiceName>
            <PartnerId>WGHHPH6471P</PartnerId>
            <Counter_id>PH647PP0120C</Counter_id>
            <reference_no>PROD_TEST</reference_no>
            <IIB_Client>10.45.1.185</IIB_Client>
            <DP_Client>10.200.9.153</DP_Client>
            <Partner_Certificate>
                <Issuer>C=GB, ST=Greater Manchester, L=Salford, O=COMODO CA Limited, CN=COMODO RSA Organization
                    Validation Secure Server CA
                </Issuer>
                <Subject>C=US, ST=Colorado, O=Western Union Holdings Inc., CN=partnerintegrationsha2.wu-gwa.com
                </Subject>
                <SerialNumber>26:0e:54:4f:b5:f6:9f:c3:0e:ea:cc:62:f5:cd:44:c2</SerialNumber>
            </Partner_Certificate>
        </Header>
        <BrokerName>ACENDP0</BrokerName>
        <ExecutionGroupLabel>AISI_EG</ExecutionGroupLabel>
        <currentTimeStamp>2026-04-22-093528070359</currentTimeStamp>
        <TransStatus>ReceiveMoneySearch_Request_Received</TransStatus>
        <OriginalMessage>
            <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
                           xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                           xmlns:tns="http://www.westernunion.com/ReceiveMoneySearch_H2H"
                           xmlns:xrsi="http://www.westernunion.com/schema/xrsi"
                           xmlns:mrm="http://www.westernunion.com/ReceiveMoneySearch_H2H_H2H">
                <soap:Body>
                    <xrsi:receive-money-search-request>
                        <channel>
                            <type>H2H</type>
                            <name>GTLR</name>
                            <version>9500</version>
                        </channel>
                        <foreign_remote_system>
                            <identifier>WGHHPH6471P</identifier>
                            <reference_no>PROD_TEST</reference_no>
                            <counter_id>PH647PP0120C</counter_id>
                            <operator_id>46198</operator_id>
                        </foreign_remote_system>
                        <payment_transaction>
                            <payment_details>
                                <destination_country_currency>
                                    <iso_code>
                                        <country_code>PH</country_code>
                                        <currency_code>PHP</currency_code>
                                    </iso_code>
                                </destination_country_currency>
                                <duplicate_detection_flag>D</duplicate_detection_flag>
                            </payment_details>
                            <mtcn>8788949180</mtcn>
                        </payment_transaction>
                    </xrsi:receive-money-search-request>
                </soap:Body>
            </soap:Envelope>
        </OriginalMessage>
    </Message>

    <Message>
        <message_id>H2H_RECEIVE_MONEY_SEARCH_WGHHPH6471P_PROD_TEST_2026-04-22-093528070359</message_id>
        <currentTimeStamp>2026-04-22-093528505308</currentTimeStamp>
        <TransStatus>ReceiveMoneySearch_Reply_Sent</TransStatus>
        <ExternalRefId>AIS_WGHHPH6471P//PROD_TEST//PH647PP0120C</ExternalRefId>
        <CorrelationId>APPIN-AIS-2012d8dc-3e50-11f1-8558-0a2d11940000</CorrelationId>
        <OriginalMessage>
            <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
                              xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                              xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <soapenv:Body>
                    <xrsi:receive-money-search-reply xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
                        <instant_notification>
                            <addl_service_charges></addl_service_charges>
                        </instant_notification>
                        <payment_transactions>
                            <payment_transaction>
                                <sender>
                                    <name name_type="D">
                                        <first_name>JUNG BEA</first_name>
                                        <last_name>SEO</last_name>
                                    </name>
                                    <address>
                                        <city>SEOUL</city>
                                        <country_code>
                                            <iso_code>
                                                <country_code>KR</country_code>
                                                <currency_code>USD</currency_code>
                                            </iso_code>
                                        </country_code>
                                        <street>219, SINGIL DONG</street>
                                    </address>
                                    <contact_phone>#############</contact_phone>
                                    <mobile_phone>
                                        <phone_number>
                                            <country_code>##</country_code>
                                        </phone_number>
                                    </mobile_phone>
                                    <mobile_details>
                                        <city_code>##</city_code>
                                    </mobile_details>
                                </sender>
                                <receiver>
                                    <name name_type="D">
                                        <first_name>JENNIFERSANGCAP</first_name>
                                        <last_name>GUEVARRA</last_name>
                                    </name>
                                    <address>
                                        <country_code>
                                            <iso_code>
                                                <country_code>PH</country_code>
                                                <currency_code>PHP</currency_code>
                                            </iso_code>
                                        </country_code>
                                    </address>
                                    <mobile_phone>
                                        <phone_number></phone_number>
                                    </mobile_phone>
                                    <mobile_details></mobile_details>
                                </receiver>
                                <financials>
                                    <taxes>
                                        <tax_worksheet></tax_worksheet>
                                    </taxes>
                                    <gross_total_amount>37300</gross_total_amount>
                                    <pay_amount>2202056</pay_amount>
                                    <principal_amount>37000</principal_amount>
                                    <charges>300</charges>
                                    <tolls>0</tolls>
                                </financials>
                                <payment_details>
                                    <expected_payout_location>
                                        <state_code></state_code>
                                        <city></city>
                                    </expected_payout_location>
                                    <destination_country_currency>
                                        <iso_code>
                                            <country_code>PH</country_code>
                                            <currency_code>PHP</currency_code>
                                        </iso_code>
                                    </destination_country_currency>
                                    <originating_country_currency>
                                        <iso_code>
                                            <country_code>KR</country_code>
                                            <currency_code>USD</currency_code>
                                        </iso_code>
                                    </originating_country_currency>
                                    <originating_city>SEOULKR4</originating_city>
                                    <transaction_type>WMF</transaction_type>
                                    <exchange_rate>59.5150400</exchange_rate>
                                    <original_destination_country_currency>
                                        <iso_code>
                                            <country_code>PH</country_code>
                                            <currency_code>PHP</currency_code>
                                        </iso_code>
                                    </original_destination_country_currency>
                                </payment_details>
                                <filing_date>04-16-26</filing_date>
                                <filing_time>0728A EDT</filing_time>
                                <money_transfer_key>5495329403</money_transfer_key>
                                <pay_status_description>W/C</pay_status_description>
                                <mtcn>8788949180</mtcn>
                                <new_mtcn>2610688788949180</new_mtcn>
                                <fusion>
                                    <fusion_status>W/C</fusion_status>
                                    <account_number></account_number>
                                </fusion>
                                <wu_network_agent_indicator></wu_network_agent_indicator>
                            </payment_transaction>
                        </payment_transactions>
                        <delivery_services></delivery_services>
                        <misc_buffer></misc_buffer>
                        <foreign_remote_system>
                            <identifier>WGHHPH6471P</identifier>
                            <reference_no>PROD_TEST</reference_no>
                            <counter_id>PH647PP0120C</counter_id>
                        </foreign_remote_system>
                    </xrsi:receive-money-search-reply>
                </soapenv:Body>
            </soapenv:Envelope>
        </OriginalMessage>
    </Message>
</Transaction>